[LANG]
language=Deutsch (Deutschland)
[FONT]
font-name=Segoe UI
welcome-text-size=62
home-text-size=22
home-section-size=24
analysis-text-size=20
analysis-section-size=22
left-panel-size=14
panel-list-size=16
panel-list-label-size=20
panel-list-header-size=16
panel-list-item-size=13
panel-button-size=12
combobox-size=16
list-combobox-size=16
checkbox-size=16
radio-size=15
elem-size=12
image-button-size=14
form-text-size=15
list-text-size=16
search-edit-size=16
message-text-size=16
setting-button-size=12
process-text-size=14
properites-title-font=18
properites-section-font=16
log-list-item-text-size=12
log-list-item-sql-size=14
[ERROR]
000000=
200001=SQL-Syntaxfehler
200002=Datei nicht gefunden
200003=Datei beschädigt
200004=Parameterfehler
200026=Tabellenname bereits vorhanden
200027=Tabellenname nicht vorhanden
200028=Fehler beim Import der CSV-Datei, SQL konnte nicht generiert werden, bitte überprüfen Sie den Inhalt der CSV-Datei und die Konfiguration
300001=Keine Tabellenspalte für die Indexerstellung ausgewählt
300002=Die SQL-Anweisung darf nicht leer sein
300003=Die SQL-Analyse unterstützt nur SELECT-Abfragen
[STRING]
home=Startseite
database=Datenbank
analysis=Analyse
view=Ansicht
setting=Einstellungen
items=Datensätze
tables=Tabellen
views=Ansichten
triggers=Trigger
columns=Spalten
indexes=Indizes
table=Tabelle
clear-all=Alle löschen
yes=Ja
no=Nein
welcome-text=Willkommen bei CuteSqlite
home-text1=CuteSqlite ist ein grafisches Client-Tool (GUI) für Sqlite3.
home-text2=Es ermöglicht Ihnen, Datenbanken zu entwerfen, zu erstellen und zu durchsuchen, Datenbankobjekte zu verwalten,
home-text3=Daten einzufügen sowie SQL-Abfragen zu entwerfen und auszuführen, um die gespeicherten Daten zu verarbeiten.
home-text4=Sie können auch Datenbanken und Daten von anderen Datenbankanbietern zu einer Sqlite-Datenbank migrieren.
db-section-text=Sqlite-Datenbank
analysis-text1=CuteSqlite ermöglicht es Ihnen, die Leistung von SQL-Anweisungen zu analysieren und zu optimieren.
analysis-text2=Und es ermöglicht Ihnen, die Speicherkapazität jeder Tabelle in der Datenbank zu analysieren,
analysis-text3=sowie die Parameter der Datenbank zu konfigurieren, um sie zu optimieren.
perf-analysis-section-text=Leistungsanalyse
error-text=Systemfehler:
create-database=Neue Datenbank erstellen (Strg+N)
open-database=Datenbank öffnen (Strg+O)
refresh-database=Datenbank aktualisieren (F5)
delete-database=Markierte Datenbank aus Liste entfernen (Entf)
override-user-db=Die Daten der gelöschten Datei können nicht wiederhergestellt werden. Bestätigen, um die Datenbank zu überschreiben?
create-db-success-text=Datenbank erfolgreich erstellt
open-db-exists-inlist=Datenbank ist bereits geöffnet, bitte wiederholen Sie den Vorgang nicht
open-db-success-text=Datenbank erfolgreich geöffnet
delete-user-db=Bestätigen, um die Datenbank "{dbName}" aus der Liste zu entfernen?
delete-db-success-text=Datenbank erfolgreich aus der Liste entfernt
query-editor=Abfrageeditor
history=Verlauf
history-tip=Verlauf (F8)
result-list=Ergebnisse
result-info=Informationen
result-table-data=Tabellendaten
table-properties=Tabelleneigenschaften
exec-select-sql=Ausgewählte Abfrage ausführen (F9)
exec-all-sql=Alle Abfragen ausführen (F10)
explain-select-sql=Explain für ausgewählte SQL-Anweisung (F11)
explain-query-plan-sql=Explain query plan für ausgewählte SQL-Anweisung (F12)
query-page-help=Autovervollständigungsfunktion: [Tab] -> nächster Tab; [Strg+Leertaste] -> Übereinstimmungen auflisten; [Strg+Eingabe] -> alle Tags auflisten
no-select-userdb=Keine Datenbank ausgewählt
no-sql-statement=Keine SQL-Anweisung im Abfrageeditor
no-sql-content=Kein SQL-Inhalt im Abfrageeditor
show-form-view=Formularansicht anzeigen
export-result-as=Exportieren als... (Strg+Alt+E)
copy-result-data=Daten in die Zwischenablage kopieren
clear-all=Alle löschen
ok=OK
cancel=Abbrechen
export-text-description=Wählen Sie das Format für den Datenexport
csv-settings=CSV-Optionen
csv-field-settings=Spalten
csv-line-settings=Zeilen
csv-charset-settings=Zeichensatz
excel-settings=Excel-Optionen
sql-settings=SQL-Optionen
export-fields-settings=Wählen Sie die zu exportierenden Spalten aus
terminated-by=Trennzeichen
enclosed-by=Einschlusszeichen
escaped-by=Escape-Zeichen
field-terminated-by=Spaltentrennzeichen
field-enclosed-by=Spalteneinschlusszeichen
field-escaped-by=Spalten-Escape-Zeichen
line-terminated-by=Zeilentrennzeichen
add-column-name=Spaltennamen in Kopfzeile einfügen
csv-charset=Zeichensatz
excel-column-max-size=Größenbeschränkung für Textspalten
excel-decinmal-places=Dezimalstellen
structure-only=Nur Struktur
data-only=Nur Daten
structure-and-data=Struktur und Daten
select-all=Alle auswählen
deselect-all=Alle abwählen
save-to-file=In Datei speichern
expert-fmt-error=Bitte wählen Sie das Dateiformat für den Datenexport aus
terminated-by-error=Bitte geben Sie den Wert für "Trennzeichen" ein
enclosed-by-error=Bitte geben Sie den Wert für "Einschlusszeichen" ein
escaped-by-error=Bitte geben Sie den Wert für "Escape-Zeichen" ein
line-terminated-by-error=Der Wert für "Zeilentrennzeichen" ist ungültig
excel-column-max-size-error=Bitte geben Sie den Wert für "Größenbeschränkung für Textspalten" ein
excel-decinmal-places-error=Bitte geben Sie den Wert für "Dezimalstellen" ein
export-sql-error=Bitte wählen Sie die SQL-Optionen aus
selected-fields-error=Bitte wählen Sie die zu exportierenden Spalten aus
export-path-error=Bitte geben Sie den Pfad der Exportdatei ein
sql-notsupport-multitable-query-error=Der Export von Ergebnissen aus Mehrfachtabellenabfragen und Unterabfragen wird nicht unterstützt
export-success-text=Export erfolgreich, {rows} Datenzeilen wurden exportiert. Datei öffnen?
open-the-file=Datei öffnen
export-file-exists-prompt={export-path} existiert bereits. Ersetzen?
limit-rows=Zeilenbegrenzung
offset=Startzeile
rows=Anzahl Zeilen
copy-all-rows-to-clipboard=Alle Zeilen in Zwischenablage kopieren Strg+Alt+A
copy-sel-rows-to-clipboard=Ausgewählte Zeilen in Zwischenablage kopieren Strg+Alt+H
copy-all-rows-as-sql=Alle Zeilen als SQL kopieren Strg+Alt+J
copy-sel-rows-as-sql=Ausgewählte Zeilen als SQL kopieren Strg+Alt+K
read-only=Schreibgeschützt
filter=Filter (Strg+Alt+F)
filter-in-use=Filter in Verwendung
refresh=Aktualisieren (Strg+F5)
refresh-page=Aktualisieren
new-row-tip=Neue Zeile (Strg+Alt+N)
copy-row-tip=Zeile kopieren (Strg+Alt+C)
save-tip=Speichern (Strg+Alt+S)
delete-tip=Ausgewählte Zeile löschen (Strg+Entf)
cancel-tip=Änderungen rückgängig machen (Strg+Alt+Z)
revert-tip=Wiederherstellen
save=Speichern
revert=Änderungen rückgängig machen
column=Spaltenname
condition=Bedingung
value=Wert
delete-confirm-text=Bestätigen, um die ausgewählten Zeilen zu löschen?
query=Abfrage
result=Ergebnis
affected-rows=Betroffene Zeilen
exec-time=Ausführungszeit
transfer-time=Übertragungszeit
total-time=Gesamtzeit
database-create=DB erstellen Strg+N
database-open=DB öffnen Strg+O
database-refresh=DB aktualisieren Strg+R
database-delete=DB löschen Entf
database-copy=DB kopieren als... Strg+P
database-export-as-sql=DB nach SQL exportieren Strg+E
database-import-from-sql=SQL in DB importieren Strg+I
database-new=Erstellen
database-new-table=Tabelle
database-new-view=Ansicht
database-new-trigger=Trigger
export-as-sql-text-description=Tabellen/Ansichten/Trigger der ausgewählten DB als SQL exportieren
select-database=Ausgewählte Datenbank
database-objects=Objekte
structure-and-data-settings=Struktur- und Dateneinstellungen
insert-statement-settings=INSERT-Anweisungseinstellungen
tbl-statement-settings=Tabellenanweisungseinstellungen
retain-column-text=Spaltennamen in "Insert Into" beibehalten
contain-multi-rows-text=Jede "Insert"-Anweisung enthält mehrere Zeilen (VALUES)
retain-table-text=Alte Tabelle beibehalten (Create Table If Not Exists ...)
override-table-text=Alte Tabelle überschreiben (DROP TABLE, dann CREATE TABLE)
import-from-sql-text-description=Stapelausführung der Anweisungen in der SQL-Datei.
abort-on-error-text=Bei Fehler anhalten.
import-file-not-exists=Die zu importierende SQL-Datei existiert nicht, bitte wählen Sie eine andere.
import-path-empty-error=Der Pfad der Importdatei darf nicht leer sein.
import=Importieren
export=Exportieren
tbl-name=Tabellenname
new-table=Tabelle erstellen
new-view=Ansicht erstellen
new-trigger=Trigger erstellen
database=Datenbank
schema=Schema
table-columns=Spalten
table-indexes=Indizes
table-foreignkeys=Fremdschlüssel
column-name=Spaltenname
data-type=Datentyp
default=Standard
check=Prüfung
index-name=Indexname
index-type=Indextyp
index-unique=Eindeutig
partial-clause=Teilklausel
comments=Kommentare
to-be-selected=Verfügbare Spalten
selected=Ausgewählte
up=▲
down=▼
no-columns-selected=Keine Spalten ausgewählt, bitte wählen Sie aus
sql-preview=SQL-Vorschau
tbl-name-empty=Der Tabellenname darf nicht leer sein
tbl-name-duplicated=Der Tabellenname existiert bereits
create-table-success-text=Tabelle erfolgreich erstellt.
alter-table-success-text=Tabelle erfolgreich geändert.
rename-table-success-text=Tabellenname erfolgreich geändert.
delete-column-confirm-text=Die ausgewählte Spalte wird von einem oder mehreren Indizes referenziert. Das Löschen dieser Spalte ändert auch die entsprechenden Indizes. Bestätigen, um fortzufahren?
delete-index-confirm-text=Der ausgewählte Index wird von einer oder mehreren Spalten referenziert. Das Löschen dieses Index ändert auch die entsprechenden Spalten. Bestätigen, um fortzufahren?
delete-confirm-text=Bestätigen, um fortzufahren?
new-view=Ansicht erstellen
new-trigger=Trigger erstellen
create-a-view-name=Name der neuen Ansicht
view-name-not-empty=Der Name der neuen Ansicht darf nicht leer sein
view-name-duplicated=Der Ansichtsname existiert bereits
create-a-trigger-name=Triggername
trigger-name-not-empty=Der Triggername darf nicht leer sein
trigger-name-duplicated=Der Triggername existiert bereits
execute-sql-success=SQL erfolgreich ausgeführt
copy-db-success-text=Datenbank erfolgreich kopiert
table-open=Tabellendaten öffnen Alt+O
table-create=Tabelle erstellen Alt+N
table-alter=Tabelle ändern Alt+A
table-rename=Tabelle umbenennen Alt+M
table-truncate=Tabelle leeren Alt+T
table-drop=Tabelle löschen Alt+Entf
table-copy-as=Tabelle kopieren nach... Alt+P
table-sharding-as=Sharding Alt+G
table-export=Tabelle exportieren nach... Alt+E
table-import-sql=Aus SQL-Datei importieren Alt+I
table-import-csv=Aus CSV-Datei importieren Alt+J
table-manage-index=Tabellenindizes verwalten
table-manage-foreign-key=Fremdschlüssel der Tabelle verwalten
properties=Eigenschaften
primary-key-duplicated=Primärschlüssel wurde mehrfach definiert.
foreignkey-name=Fremdschlüsselname
referencing-columns=Spalten dieser Tabelle
referenced-table=Referenztabelle
referenced-columns=Referenzspalten
on-update=Bei Aktualisierung
on-delete=Bei Löschung
insert-new-column=Neue Spalte hinzufügen
insert-new-index=Neuen Index hinzufügen
insert-new-foreignkey=Neuen Fremdschlüssel hinzufügen
insert-del-column=Ausgewählte Spalte löschen
insert-del-index=Ausgewählten Index löschen
insert-del-foreignkey=Ausgewählten Fremdschlüssel löschen
select-referenced-table-first=Bitte wählen Sie zuerst die Referenztabelle aus
new-table-name=Neuer Tabellenname
table-name-not-empty=Der neue Tabellenname darf nicht leer sein
table-name-duplicated=Der neue Tabellenname existiert bereits
ai-column-exists=Eine AUTOINCREMENT-Spalte existiert bereits.
ai-fobidden-multi-pk=Es existiert bereits eine AUTOINCREMENT-Spalte, mehrere Primärschlüsselspalten sind nicht zulässig.
ai-column-must-integer=Die AUTOINCREMENT-Spalte muss vom Typ INTEGER sein.
truncate-table-confirm-text=Nach dem Leeren der Tabelle können die Daten nicht wiederhergestellt werden. Bestätigen, um zu leeren?
truncate-table-success-text=Tabellendaten erfolgreich geleert
drop-table-confirm-text=Nach dem Löschen der Tabelle können die Daten nicht wiederhergestellt werden. Bestätigen, um zu löschen?
drop-table-success-text=Tabelle erfolgreich gelöscht
copy-table-text-description=Konfiguration der Kopierparameter, unterstützt Tabellen-Sharding
from-db-name=Quelldatenbank
from-tbl-name=Quelltabelle
to-db-name=Zieldatenbank
to-tbl-name=Zieltabelle
table-sharding-setttings=Tabellen-Sharding
enable-table-sharding=Tabellen-Sharding aktivieren
table-suffix-begin={suffix} Start-Integer
table-suffix-end={suffix} End-Integer
advanced-settings=Erweiterte Sharding-Optionen
enable-copy-data-with-strategy=Strategie zum Kopieren von Daten in Sharding-Tabellen aktivieren
sharding-strategy-express-text=Sharding-Strategieausdruck: {n}
preview-sql=SQL-Vorschau
structure-and-data-settings-unknown=Struktur- und Dateneinstellungen nicht ausgewählt
table-suffix-error=Ungültige Sharding-Integer, bitte geben Sie einen korrekten Wert ein
target-table-name-no-n=Die Zieltabelle muss die Zeichenkette "{n}" enthalten.
sharding-strategy-express-empty=Der Sharding-Strategieausdruck darf nicht leer sein
copy-table-success-text=Tabelle erfolgreich kopiert.
start=Start
complete=Fertig
express-title=Tabellen-Sharding-Strategieausdruck
functions=Funktionen
express-editor-help=Ausdruck - Doppelklicken Sie auf eine Funktion oder ein Feld, um es in den Editor einzufügen
import-from-csv-text-description=Konfiguration zum Importieren von Daten aus einer CSV-Datei
source-csv-file=Pfad der Quell-CSV-Datei
target-database=Zieldatenbank
target-table=Zieltabelle
columns-setttings=Spalten
csv-data=CSV-Daten
column-name-on-top=Erste Zeile als Spaltennamen
line-terminated-by=Zeilentrennzeichen
csv-null-as-keyword=null/NULL als SQL-Schlüsselwort
encoding=Zeichensatz
import-success-text=Import erfolgreich
incorrect-sql-statement=Falsche SQL-Anweisung
import-error-text=Importfehler
table-manage-columns=Spalten verwalten
table-drop-column=Spalte löschen
table-manage-indexes=Indizes verwalten
table-drop-index=Index löschen
create-view=Neue Ansicht erstellen
open-view=Ansicht öffnen
drop-view=Ansicht löschen
create-trigger=Trigger erstellen
open-trigger=Trigger öffnen
drop-trigger=Trigger löschen
drop-view-confirm-text=Nach dem Löschen der Ansicht kann sie nicht wiederhergestellt werden. Bestätigen, um zu löschen?
drop-view-success-text=Ansicht erfolgreich gelöscht
drop-trigger-confirm-text=Nach dem Löschen des Triggers kann er nicht wiederhergestellt werden. Bestätigen, um zu löschen?
drop-trigger-success-text=Trigger erfolgreich gelöscht
sql-templates=SQL-Anweisungsvorlagen
pragma-templates=Pragmas
sql-log=SQL-Verlauf
clear-all=Alle löschen
use=Verwenden
explain=Explain
top=Anheften
untop=Loslösen
copy=Kopieren
delete=Löschen
today=Heute
yestoday=Gestern
delete-sql-log-confirm-text=Sind Sie sicher, dass Sie den SQL-Verlauf löschen möchten?
copy-to-clipboard=In die Zwischenablage kopiert
save-success-text=Speichern erfolgreich
delete-success-text=Löschen erfolgreich
data-has-changed=Die Daten wurden geändert. Sind Sie sicher, dass Sie die Seite schließen möchten?
not-save-and-close=Nicht speichern, schließen
cancel=Schließen abbrechen
table-export-as=Tabelle exportieren Alt+E
export-as-sql-success-text=Export erfolgreich. Datei öffnen?
new-query=Neues Abfragefenster (F7)
save-current=Aktuelles speichern (Strg+S)
save-all=Alle speichern (Strg+Umsch+S)
first-page=Erste Seite
prev-page=Vorherige Seite
next-page=Nächste Seite
last-page=Letzte Seite
save-if-data-has-changed=Die Daten wurden geändert. Vor dem Schließen speichern?
unsort=Sortierung aufheben
tab-close-this=Diese schließen
tab-close-others=Andere schließen
tab-close-left=Alle links schließen
tab-close-right=Alle rechts schließen
perf-analysis=Leistungsanalyse
perf-analysis-reports=Analyseberichte
store-analysis=Speicheranalyse
db-params=DB-Parameter
not-select-sql=Es werden nur SELECT-Anweisungen unterstützt
open-sql-log=SQL-Verlauf für Leistungsanalyse öffnen (Strg+L)
add-sql-analysis=SQL-Anweisung für Leistungsanalyse eingeben (Strg+I)
sql-log-not-found=SQL-Verlauf nicht gefunden, bitte prüfen, ob er gelöscht wurde
original-sql=Ursprüngliche SQL-Anweisung
where-clause-analysis=WHERE-Klausel-Analyse
order-clause-analysis=ORDER-Klausel-Analyse
covering-index-analysis=Covering-Index-Analyse
table-join-analysis=JOIN-Analyse
in-table=Datentabelle
where-use-column=Die WHERE-Klausel verwendet Spalten
order-use-column=Die ORDER-Klausel verwendet Spalten
covering-index-column=Die WHERE- und ORDER-Klauseln verwenden Spalten
where-use-index=Die WHERE-Klausel verwendet einen Index
order-use-index=Die ORDER-Klausel verwendet einen Index
use-covering-index=Verwendet einen Covering-Index
create-index-for-performance=Empfehlung: Erstellen Sie einen Index für die folgenden Spalten, um die Abfrageleistung zu verbessern
hint-index-for-performance=Hinweis: Der Index {hintIndexName} deckt bereits die Spalten ab: {hintIndexColumns}
create-covering-index-for-performance=Empfehlung: Erstellen Sie einen Covering-Index für die folgenden Spalten, um die Abfrageleistung zu verbessern
create-index-togeger=Index erstellen (gemeinsam)
create-index-individ=Indizes erstellen (einzeln)
create-covering-index=Covering-Index erstellen
explain-query-plan=Explain Query Plan
query-optimizer-pseudocode=Der folgende Pseudocode zeigt den Ausführungsprozess des Abfrageoptimierers
cycle-count=Zyklusstatistiken
optimize-cycle-count=Hinweis: Eine Änderung der JOIN-Reihenfolge der Tabellen kann optimieren und die Anzahl der Zyklen reduzieren.
general-settings=Allgemeine Einstellungen
about=Über
language-setting=Spracheinstellung der Benutzeroberfläche
change-language-restart-text=Um die Sprache zu ändern, muss die Software neu gestartet werden.
close-and-restart=Schließen und neu starten
do-not-restart=Nicht neu starten
about-us=Über uns
about-us-description=CuteSqlite ist eine Open-Source-Software, die vom Autor Xuehan Qin entwickelt wurde.
version-info=Version
version-info-description=CuteSqlite v0.2.2 beta (64-Bit)
feedback=Feedback
feedback-description=Wenn Sie Probleme mit der Software haben oder Ideen und Vorschläge für diese Anwendung haben, füllen Sie bitte das folgende Formular aus, um uns Ihr Feedback zu geben.
content-text=Inhalt
license=Apache-Lizenz Version 2.0
select-columns-analysis=SELECT-Spaltenanalyse
select-use-column=Die SELECT-Anweisung verwendet die folgenden Spalten
select-use-column-count=Anzahl der Spalten
select-use-column-advice=Empfehlung: Die SELECT-Anweisung wählt mehr als {maxColumns} Spalten aus. Eine Reduzierung der Spaltenanzahl kann die Abfrageleistung verbessern.
select-use-column-tips=Hinweis: Eine Reduzierung der Spaltenanzahl kann die Abfrageleistung verbessern.
sql-perf-report-prefix=leistungsbericht-sql-
store-analysis-prefix=Speicheranalyse:
analysis-sql=SQL-Analyse
open-perf-report=Bericht öffnen Alt+O
drop-perf-report=Bericht löschen Alt+Entf
drop-perf-report-confirm-text=Bestätigen, um den Bericht zu löschen?
store-analysis-text=Ermöglicht die Analyse der Speicherkapazität der Datenbank, der Tabellen und der Tabellenindizes
table-store-analysis=Tabelle - {tblName}
index-store-analysis=Index - {idxName} - Tabelle: {tblName}
db-disk-used-title=Bericht zur Festplattenplatznutzung, DB-Pfad: {dbPath}
page-size-text=Seitengröße (Byte)
page-size-tips=Seitengröße (Byte)
file-bytes-text=Dateigröße (Byte)
file-bytes-tips=Dateigröße (Byte)
file-pgcnt-text=Anzahl der Seiten in der gesamten Datei (gemessen)
file-pgcnt-tips=Anzahl der Seiten in der gesamten Datei (gemessen)
file-pgcnt2-text=Anzahl der Seiten in der gesamten Datei (berechnet)
file-pgcnt2-tips=Anzahl der Seiten in der gesamten Datei (berechnet)
inuse-pgcnt-text=Anzahl der Seiten, die Daten speichern (verwendet)
inuse-pgcnt-tips=Anzahl der Seiten, die Daten speichern (verwendet)
free-pgcnt2-text=Anzahl der Seiten ohne Daten (pro Kopf)
free-pgcnt2-tips=Anzahl der Seiten ohne Daten (pro Kopf)
free-pgcnt-text=Anzahl der Seiten ohne Daten (berechnet)
free-pgcnt-tips=Anzahl der Seiten ohne Daten (berechnet)
av-pgcnt-text=Anzahl der automatisch geleerten Seiten
av-pgcnt-tips=Anzahl der automatisch geleerten Seiten
ntable-text=Anzahl der Tabellen in der DB
ntable-tips=Anzahl der Tabellen in der DB
nindex-text=Anzahl der Indizes
nindex-tips=Anzahl der Indizes
nmanindex-text=Anzahl der definierten Indizes
nmanindex-tips=Anzahl der definierten Indizes
nautoindex-text=Anzahl der impliziten Indizes (Auto-Inkrement-Indizes)
nautoindex-tips=Anzahl der impliziten Indizes (Auto-Inkrement-Indizes)
user-payload-text=Byte der gespeicherten Nutzlast des Benutzers
user-payload-tips=Byte der gespeicherten Nutzlast des Benutzers
all-tbl-entrycnt-title=Gesamtdaten aller Tabellen (Anzahl der Datensätze)
all-tbl-idx-pagecnt-title=Gesamtseitenzahl aller Tabellen und ihrer Indizes
sperate-tbl-idx-pagecnt-title=Seiten aller Tabellen und Indizes separat berechnet
all-tbl-idx-report-title=Alle Tabellen und Indizes
total-pages-percent-text=Prozentsatz der gesamten DB-Seiten
total-pages-percent-tips=Prozentsatz der gesamten DB-Seiten
nentry-text=Datenmenge (Anzahl der Datensätze)
nentry-tips=Datenmenge (Anzahl der Datensätze)
storage-text=Genutzte Speicherbytes
storage-tips=Genutzte Speicherbytes
compressed-size-text=Genutzte Bytes nach Komprimierung
compressed-size-tips=Genutzte Bytes nach Komprimierung
payload-text=Nutzlast-Bytes
payload-tips=Nutzlast-Bytes
total-meta-text=Metadaten-Bytes
total-meta-tips=Metadaten-Bytes
depth-text=B-Baum-Tiefe
depth-tips=B-Baum-Tiefe
avg-payload-text=Durchschnittliche Nutzlast pro Datensatz
avg-payload-tips=Durchschnittliche Nutzlast pro Datensatz
avg-unused-text=Durchschnittlich ungenutzte Bytes pro Datensatz
avg-unused-tips=Durchschnittlich ungenutzte Bytes pro Datensatz
avg-meta-text=Durchschnittliche Metadaten pro Datensatz
avg-meta-tips=Durchschnittliche Metadaten pro Datensatz
avg-fanout-text=Durchschnittlicher Verzweigungsfaktor
avg-fanout-tips=Durchschnittlicher Verzweigungsfaktor
gap-cnt-text=Nicht zusammenhängende Seiten
gap-cnt-tips=Nicht zusammenhängende Seiten
mx-payload-text=Maximale Nutzlast pro Datensatz
mx-payload-tips=Maximale Nutzlast pro Datensatz
ovfl-cnt-text=Anzahl der verwendeten Überlaufdatensätze
ovfl-cnt-tips=Anzahl der verwendeten Überlaufdatensätze
int-pages-text=Anzahl der verwendeten Indexseiten
int-pages-tips=Anzahl der verwendeten Indexseiten
leaf-pages-text=Anzahl der verwendeten Blattseiten
leaf-pages-tips=Anzahl der verwendeten Blattseiten
ovfl-pages-text=Anzahl der verwendeten Überlaufseiten
ovfl-pages-tips=Anzahl der verwendeten Überlaufseiten
total-pages-text=Gesamtanzahl der verwendeten Seiten
total-pages-tips=Gesamtanzahl der verwendeten Seiten
int-unused-text=Ungenutzte Bytes auf Indexseiten
int-unused-tips=Ungenutzte Bytes auf Indexseiten
leaf-unused-text=Ungenutzte Bytes auf Blattseiten
leaf-unused-tips=Ungenutzte Bytes auf Blattseiten
ovfl-unused-text=Ungenutzte Bytes auf Überlaufseiten
ovfl-unused-tips=Ungenutzte Bytes auf Überlaufseiten
total-unused-text=Ungenutzte Bytes auf allen Seiten
total-unused-tips=Ungenutzte Bytes auf allen Seiten
all-table-report-title=Alle Tabellen (ohne Indizes)
all-indices-report-title=Alle Indizes (ohne Tabellen)
tbl-and-all-idx-report-title=Tabelle {tblName} und alle ihre Indizes
tbl-only-report-title=Tabelle {tblName} (ohne Indizes)
idx-only-report-title=Alle Indizes der Tabelle {tblName}
tbl-report-title=Tabelle {tblName}
idx-report-title=Index {idxName} der Tabelle {tblName}
props-tbl-only-report-title=Speicheranalyse der Tabelle {tblName}
props-idx-props-only-report-title=Alle Indizes der Tabelle {tblName}
db-pragma-params=PRAGMA-Parameter
db-quick-config-params=Schnellkonfigurationsoptionen
select-pragma=PRAGMA
pragma-analysis-limit-tips=Abrufen oder Ändern des Grenzwerts für die Analyseeinstellungen (ANALYZE). Dies ist die ungefähre Anzahl von Zeilen, die der ANALYZE-Befehl in jedem Index untersucht.
pragma-application-id-tips=Zum Abrufen oder Setzen der 32-Bit-signed Big-Endian "Application ID" Integer an Offset 68 im Datenbank-Header.
pragma-auto-vacuum-tips=Abrufen oder Setzen des Auto-Vacuum-Status in der Datenbank.
pragma-automatic-index-tips=Abrufen, Aktivieren oder Deaktivieren der automatischen Indexfunktion.
pragma-busy-timeout-tips=Abrufen oder Ändern der Busy-Timeout-Einstellung.
pragma-cache-size-tips=Abrufen oder Ändern der maximalen Anzahl von Datenbank-Disk-Seiten, die SQLite für jede geöffnete Datenbankdatei im Speicher zu halten empfiehlt.
pragma-cache-spill-tips=Aktivieren oder Deaktivieren der Fähigkeit des Paging-Programms, schmutzige Cache-Seiten mitten in einer Transaktion in die Datenbankdatei zu schreiben.
pragma-case-sensitive-like-tips=Das Standardverhalten des LIKE-Operators ignoriert die Groß-/Kleinschreibung für ASCII-Zeichen. Daher ist standardmäßig 'a' LIKE 'A' wahr.
pragma-cell-size-check-tips=Aktiviert oder deaktiviert zusätzliche Plausibilitätsprüfungen beim Lesen von Datenbank-B-Baum-Seiten von der Platte. Wenn die Zellgrößenprüfung aktiviert ist, kann eine Datenbankbeschädigung früher erkannt werden und ist weniger wahrscheinlich, sich "auszubreiten".
pragma-checkpoint-fullfsync-tips=Abrufen oder Ändern des Fullfsync-Flags für Checkpoint-Operationen. Wenn dieses Flag gesetzt ist, wird bei Checkpoint-Operationen auf Systemen, die F_FULLFSYNC unterstützen, die F_FULLFSYNC-Synchronisierungsmethode verwendet. Der Standardwert des CHECKPOINT_FULLFSYNC-Flags ist OFF. Nur Mac OS-X unterstützt F_FULLFSYNC.
pragma-collation-list-tips=Gibt eine Liste der für die aktuelle Datenbankverbindung definierten Sortierfolgen (Collations) zurück.
pragma-compile-options-tips=Gibt die Namen der beim Erstellen von SQLite verwendeten Kompilierungsoptionen zurück, eine Option pro Zeile.
pragma-count-changes-tips=Abrufen oder Ändern des Count-Changes-Flags. Normalerweise, wenn das Count-Changes-Flag nicht gesetzt ist, geben INSERT-, UPDATE- und DELETE-Anweisungen keine Daten zurück.
pragma-data-store-directory-tips=Abrufen oder Ändern des Werts der globalen Variablen sqlite3_data_directory, die vom Windows-Betriebssystem-Schnittstellen-Backend verwendet wird, um den Speicherort von Datenbankdateien zu bestimmen, die mit einem relativen Pfad angegeben wurden.
pragma-data-version-tips=Zeigt an, dass die Datenbankdatei geändert wurde. Interaktive Programme, die Datenbankinhalte im Speicher halten oder auf dem Bildschirm anzeigen, können den PRAGMA data_version-Befehl verwenden, um festzustellen, ob sie den Speicher aktualisieren und neu laden oder die Bildschirmanzeige aktualisieren müssen.
pragma-default-cache-size-tips=Abrufen oder Festlegen der empfohlenen maximalen Anzahl von Plattencache-Seiten, die für jede geöffnete Datenbankdatei zugewiesen werden.
pragma-defer-foreign-keys-tips=Weist an, dass alle Fremdschlüssel-Constraints bis zum Commit der äußersten Transaktion zurückgestellt werden.
pragma-empty-result-callbacks-tips=Abrufen oder Ändern des Empty-Result-Callback-Flags.
pragma-encoding-tips=Die vom Hauptdatenbank verwendete Textkodierung: 'UTF-8', 'UTF-16le' (UTF-16 Little-Endian) oder 'UTF-16be' (UTF-16 Big-Endian).
pragma-foreign-key-check-tips=Überprüft die Datenbank oder Tabelle auf Verstöße gegen Fremdschlüssel-Constraints.
pragma-foreign-keys-tips=Abrufen, Aktivieren oder Deaktivieren der Durchsetzung von Fremdschlüssel-Constraints.
pragma-freelist-count-tips=Gibt die Anzahl der ungenutzten Seiten in der Datenbankdatei zurück.
pragma-full-column-names-tips=Abrufen oder Ändern des Full-Column-Names-Flags.
pragma-fullfsync-tips=Abrufen oder Ändern des Fullfsync-Flags. Dieses Flag bestimmt, ob die F_FULLFSYNC-Synchronisierungsmethode auf Systemen verwendet wird, die sie unterstützen. Der Standardwert von Fullfsync ist OFF. Nur Mac OS X unterstützt F_FULLFSYNC.
pragma-hard-heap-limit-tips=Legt eine Grenze für die Menge des Heap-Speichers für alle Datenbankverbindungen in einem einzelnen Prozess fest.
pragma-ignore-check-constraints-tips=Aktiviert oder deaktiviert die Durchsetzung von CHECK-Constraints. Die Standardeinstellung ist OFF, was bedeutet, dass CHECK-Constraints standardmäßig durchgesetzt werden.
pragma-incremental-vacuum-tips=Bewirkt, dass bis zu N Seiten aus der Freeliste entfernt werden.
pragma-integrity-check-tips=Führt eine Low-Level-Formatierungs- und Konsistenzprüfung der Datenbank durch.
pragma-journal-mode-tips=Abrufen oder Festlegen des Journalmodus für die mit der aktuellen Datenbankverbindung verbundene Datenbank.
pragma-journal-size-limit-tips=Begrenzt die Größe der Rollback-Journale und WAL-Dateien, die nach einer Transaktion oder einem Checkpoint im Dateisystem verbleiben.
pragma-legacy-alter-table-tips=Setzt oder ruft den Wert des Legacy-Alter-Table-Flags ab.
pragma-locking-mode-tips=Setzt oder ruft den Sperrmodus (Locking Mode) der Datenbankverbindung ab. Die Modi sind NORMAL oder EXCLUSIVE.
pragma-max-page-count-tips=Abrufen oder Festlegen der maximalen Seitenanzahl in der Datenbankdatei.
pragma-mmap-size-tips=Abrufen oder Ändern der maximalen Anzahl von Bytes, die für speicherzugeordnete E/A (Memory-Mapped I/O) für eine einzelne Datenbank reserviert sind.
pragma-module-list-tips=Gibt eine Liste der bei der Datenbankverbindung registrierten virtuellen Tabellenmodule zurück.
pragma-optimize-tips=Versucht, die Datenbank zu optimieren.
pragma-page-count-tips=Gibt die Gesamtseitenzahl in der Datenbankdatei zurück.
pragma-page-size-tips=Abrufen oder Festlegen der Seitengröße der Datenbank. Die Seitengröße muss eine Zweierpotenz zwischen 512 und 65536 sein.
pragma-parser-trace-tips=Schaltet die Ablaufverfolgung (Trace) des von SQLite intern verwendeten SQL-Parsers ein. Wirkt nur, wenn mit SQLITE_DEBUG kompiliert wurde.
pragma-query-only-tips=Verhindert Datenänderungen in der Datenbankdatei. Wenn aktiviert, führt jeder Versuch von CREATE, UPDATE, DROP, INSERT oder UPDATE zu einem SQLITE_READONLY-Fehler.
pragma-quick-check-tips=Führt eine Low-Level-Formatierungs- und Konsistenzprüfung der Datenbank durch und überspringt dabei die Konsistenzprüfungen für UNIQUE und Indizes.
pragma-read-uncommitted-tips=Abrufen, Aktivieren oder Deaktivieren der READ UNCOMMITTED-Isolation.
pragma-recursive-triggers-tips=Abrufen, Aktivieren oder Deaktivieren der rekursiven Ausführung von Triggern.
pragma-reverse-unordered-selects-tips=Wenn aktiviert, bewirkt dieses PRAGMA, dass viele SELECT-Anweisungen ohne ORDER BY-Klausel die Ergebnisse in einer normalerweise umgekehrten Reihenfolge ausgeben.
pragma-schema-version-tips=Ruft den Integer-Wert schema_version an Offset 40 im Datenbank-Header ab oder setzt ihn.
pragma-secure-delete-tips=Abrufen oder Ändern der Secure-Delete-Einstellung.
pragma-short-column-names-tips=Abrufen oder Ändern des Short-Column-Names-Flags.
pragma-soft-heap-limit-tips=Begrenzt die Menge des von allen Datenbankverbindungen in einem einzelnen Prozess verwendeten Heap-Speichers.
pragma-stats-tips=Gibt Hilfsinformationen über Tabellen und Indizes zurück.
pragma-synchronous-tips=Abrufen oder Ändern der Einstellung des "synchronous"-Flags.
pragma-temp-store-tips=Abrufen oder Ändern des Werts der globalen Variablen sqlite3_temp_directory, die von vielen Betriebssystem-Schnittstellen-Backends verwendet wird, um den Speicherort für temporäre Tabellen und Indizes zu bestimmen.
pragma-threads-tips=Anzahl der Hilfsthreads, die von einer vorbereiteten Anweisung (Prepared Statement) gestartet werden, um bei der Abfrage zu helfen.
pragma-trusted-schema-tips=Ob die Ausführung von nicht sicherheitsgeprüften SQL-Funktionen und virtuellen Tabellen im Schema erlaubt ist. Bestimmt, ob Ansichten, Trigger oder Schemaausdrücke (wie CHECK-Constraints, DEFAULT-Klauseln, generierte Spalten, Ausdrucksindizes und/oder partielle Indizes) nicht sicherheitsgeprüfte SQL-Funktionen und virtuelle Tabellen ausführen dürfen.
pragma-user-version-tips=Ruft den Integer-Wert user_version an Offset 60 im Datenbank-Header ab oder setzt ihn.
pragma-vdbe-addoptrace-tips=Vollständige VDBE-Operationscodes werden während der Codegenerierung angezeigt. Vorausgesetzt, SQLite wurde mit der SQLITE_DEBUG-Option kompiliert und vdbe_debug ist aktiviert.
pragma-vdbe-debug-tips=Aktiviert das VDBE-Debugging. Vorausgesetzt, SQLite wurde mit der SQLITE_DEBUG-Option kompiliert.
pragma-vdbe-listing-tips=Zeigt eine vollständige Liste der virtuellen Maschinen-Operationscodes auf der Standardausgabe an. Vorausgesetzt, SQLite wurde mit der SQLITE_DEBUG-Option kompiliert und vdbe_debug ist aktiviert.
pragma-vdbe-trace-tips=Gibt die virtuellen Maschinen-Operationscodes während der Berechnung auf der Standardausgabe aus. Vorausgesetzt, SQLite wurde mit der SQLITE_DEBUG-Option kompiliert und vdbe_debug ist aktiviert.
pragma-wal-autocheckpoint-tips=Abrufen oder Festlegen des Auto-Checkpoint-Intervalls für das Write-Ahead-Log (WAL).
pragma-wal-checkpoint-tips=Bewirkt, dass der Inhalt des Write-Ahead-Logs (WAL) für die Datenbank X in der Verbindung D in die Datenbankdatei übertragen und das Write-Ahead-Log zurückgesetzt wird.
pragma-writable-schema-tips=Ermöglicht die Änderung der sqlite_schema-Tabelle mit gewöhnlichen UPDATE-, INSERT- und DELETE-Anweisungen. Warnung: Missbrauch dieses PRAGMA kann leicht zur Beschädigung der Datenbankdatei führen.
pragma-save-confirm=Die PRAGMA-Anweisung wirkt sich auf den Datenbankbetrieb aus. Bestätigen, um die folgende Anweisung auszuführen?
confirm-exec-text=Bestätigen & ausführen